#include <stdio.h>
int main()
{
    printf("%d\n", 10 / 2);
    printf("%d\n", 10 % 2);
    printf("%d\n", 10 / 3);    // 取整，整数计算结果一定是整数，小数计算结果一定是小数
    printf("%lf\n", 10.0 / 3); // 整数和小数混合计算结果一定是小数
    printf("%d\n", 10 % 3);    // 取余,运算的数据必须全部是整数

    // 小数直接参与计算，结果可能不精确
    printf("%lf\n", 3.33333333333333333333333333333 + 6.666666666666666666666666666666);

    //获取余数的正负，总数与第一个数字保持一致
    printf("%d\n", -10 % 3);
    printf("%d\n", 10 % -3);
    printf("%d\n", -10 % -3);
    
    return 0;
}
